Revit 2026 API

# BuiltInFailuresTilePatternTileFailures Class

---

Failures related to tile pattern tile.

SystemObject Autodesk.Revit.DBBuiltInFailuresTilePatternTileFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class TilePatternTileFailures
```
```vb
Public NotInheritable Class TilePatternTileFailures
```
```cpp
public ref class TilePatternTileFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TilePatternTileFailures = class end
```

The BuiltInFailuresTilePatternTileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TilePatternTile_InvalidFamily | Family not appropriate for Divided Surface component. |

#### Reference

Autodesk.Revit.DB Namespace